      * Tests PIC S9(5) SIGN TRAILING SEPARATE. Expected output: 00042-
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPE-ZONED-DECIMAL-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC S9(5) SIGN IS TRAILING SEPARATE CHARACTER VALUE -42.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY WS-A
           STOP RUN.
