           05  ST-FIELD-A           PIC X(10).
           05  ST-FIELD-B           PIC 9(05).
           05  ST-FIELD-C           PIC S9(7)V99 COMP-3.
